OpenFOAM-v2112-AD/tutorials/combustion/reactingFoam/RAS/chokedNozzle/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    chemistrySolver   ode;
    chemistryThermo   psi;
    TDAC              off;
}

initialChemicalTimeStep 1e-07;

chemistry       off;

odeCoeffs
{
    solver          Rosenbrock34;  // Rosenbrock34, seulex or rodas23
    absTol          1e-12;
    relTol          1e-7;
}


// ************************************************************************* //
