OpenFOAM-v2112-AD/tutorials/combustion/reactingFoam/RAS/chokedNozzle/constant/reactionsGRI
species
(
    O2
    N2
)
;

reactions
{}


elements
();
